4Alisa/9/AccumulationRegisters/ПартииТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

4Alisa/9/Documents/ПриходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ПриходнаяНакладная</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПартииТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокТоваров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

4Alisa/9/CommonModules/омПартионныйУчетСервер/Ext/Module.bsl
&НаСервере
Функция ВернутьТекстЗапросаПартии()
Возврат "ВЫБРАТЬ
        |	тзТовары.Товар
        |ПОМЕСТИТЬ ВТ_ТЧ
        |ИЗ
        |	&тзТовары КАК тзТовары
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |	ПартииТоваровОстатки.Товар КАК Товар,
        |	ПартииТоваровОстатки.Партия КАК Партия,
        |	ЕСТЬNULL(ПартииТоваровОстатки.КоличествоОстаток, 0) КАК ОстатокПартии
        |ИЗ
        |	РегистрНакопления.ПартииТоваров.Остатки(
        |			&ДатаСреза,
        |			Товар В
        |				(ВЫБРАТЬ
        |					Товары.Товар КАК Товар
        |				ИЗ
        |					ВТ_ТЧ КАК Товары)) КАК ПартииТоваровОстатки
        |
        |УПОРЯДОЧИТЬ ПО
        |	Товар,
        |	Партия";
КонецФункции

&НаСервере
Процедура ВыбратьДанныеПартионногоУчетаПоСпискуТоваров(ДатаСреза, тзТовары, сзПартииКСписанию, Отказ=ЛОЖЬ) Экспорт
	ТекстЗапроса = ВернутьТекстЗапросаПартии();
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("тзТовары",тзТовары);
	Запрос.УстановитьПараметр("ДатаСреза",ДатаСреза);		
	РЗапроса = Запрос.Выполнить();
	тзОстаткиПартий = РЗапроса.Выгрузить();
	СтрокаПолейСтруктуры = "Товар,Партия,Количество,КоличествоОстаток,ФлагНарушенияПУ";
	Для Каждого СтрТ из тзТовары Цикл		
		ОбъемКСписанию = СтрТ.Количество;
		ОтборПартий = Новый Структура("Товар", СтрТ.Товар);
		тзПартииПоТовару = тзОстаткиПартий.Скопировать(ОтборПартий);
		тзПартииПоТовару.Сортировать("Партия");
		Пока ОбъемКСписанию > 0 Цикл
			Для Каждого СтрППТ из тзПартииПоТовару Цикл
				КоличествоВПартии = СтрППТ.ОстатокПартии;
				ТекЗнПоСписанию = Мин(КоличествоВПартии,ОбъемКСписанию);
				сзПартииКСписанию.Добавить(Новый Структура(СтрокаПолейСтруктуры, СтрППТ.Товар,СтрППТ.Партия,ТекЗнПоСписанию,СтрППТ.ОстатокПартии,ЛОЖЬ));
				ОбъемКСписанию = ОбъемКСписанию - ТекЗнПоСписанию;
				Если ОбъемКСписанию <= 0 Тогда Прервать; КонецЕсли;
			КонецЦикла;
			
			// Если партионный учет нарушен, то остаток положительный, тогда
			// Гасим весь оставшийся объем пустой ссылкой на поступление для данного товара,
			// В допполе пишем флаг нарушения ПУ и прерываем цикл по данному товару
			Если ОбъемКСписанию > 0 Тогда
			    сзПартииКСписанию.Добавить(Новый Структура(СтрокаПолейСтруктуры, СтрППТ.Товар,Документы.ПриходнаяНакладная.ПустаяСсылка(),ОбъемКСписанию,СтрППТ.ОстатокПартии,ИСТИНА));
				ОбъемКСписанию = 0;
				Отказ = Истина;
				Прервать;
			КонецЕсли;	
			
			Прервать; // делаем невозможным бесконечный цикл (контрольно)
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры
